app/controllers/doctors_controller.rb

  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save
---
INSERT INTO "doctors" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Rodj"], ["created_at", "2022-09-09 15:36:36.368465"], ["updated_at", "2022-09-09 15:36:36.368465"]]