app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Статья"], ["body", "Knew"], ["user_id", 1], ["created_at", "2022-09-13 11:22:42.927004"], ["updated_at", "2022-09-13 11:22:42.927004"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save