app/controllers/users_controller.rb

  def create
    # binding.pry
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", ""], ["created_at", "2022-09-06 15:20:01.846926"], ["updated_at", "2022-09-06 15:20:01.846926"]]

    def set_user
      # binding.pry
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]